def rename():
    education={'외국어학원', '보습학원', '유아원', '기능학원', '기타교육', '독서실', '학원(회원제형태)', '초중고교육기관', '대학등록금', '컴퓨터학원', '문구용품', '기타서적문구', '학습지교육', '예체능학원','완구점', '전문서적', '출판인쇄물', '서적출판(회원제형태)', '산후조리원', '과학기자재'}
    entertain={'노래방', '문화취미기타', '볼링장', '티켓', '영화관', '상품권','악기점', '일반서적', '화랑', '수족관'}
    medical={'약국', '의원', '종합병원', '의료용품', '기타의료기관및기기', '한의원', '한약방', '치과의원', '치과병원', '병원', '제약회사', '건강진단'}
    beauty={'피부미용실', '안마스포츠마사지','미용원' '화장품', '이용원', '미용재료'}
    shopping={'인터넷종합Mall', '악세사리', '기타잡화', '면세점', '성인용품점', '가전제품', '스포츠의류', '정장', '가방', '기타가구', '옷감직물', '카메라', '양품점', '시계', '안경', '화방표구점', '소프트웨어', '인터넷Mall', 'DVD음반테이프판매', '기념품점', '민예공예품', '골동품점', '신발', '기타의류', '단체복', '아동의류', '컴퓨터', '기타사무용', '맞춤복점', '귀금속', '캐쥬얼의류', '제화점', 'CATV', '사무기기'}
    grocery={'편의점', '대형할인점', '슈퍼마켓', '주류판매점', '제과점', '농축수산품', '농협하나로클럽', '정육점', '구내매점','스넥', '기타음료식품', '기타건강식', '연쇄점', '인삼제품', '홍삼제품'}
    travel={'콘도', '특급호텔', '2급호텔', '기타숙박업', '1급호텔', '항공사', '관광여행'}
    construction_etc={'기계공구', '기타건축자재', '건축요업품','유리', '목재석재철물', '인테리어', '조명기구', '냉열기기', '보일러펌프', '페인트', '철제가구', '일반가구', '침구수예점', '기타연료', '기타광학품', '기타업종'}
    liquor={'단란주점', '주점','유흥주점','기타회원제형태업소', '칵테일바'}
    leisure={'골프경기장', '헬스크럽', '기타레져업', '당구장', '레져업소(회원제형태)', '수영장', '테니스장', '기타대인서비스', '스포츠레져용품', '골프용품', '레져용품수리', '골프연습장', '종합레져타운'}
    agriculture={'농축협직영매장','기타농업관련', '비료농약사료종자', '미곡상', '농기계'}
    housing={'공공요금', '애완동물', '동물병원', '정수기', '기타전기제품', '주방용구', '카페트커텐천막', '기타직물', '내의판매점', '주방용식기'}
    automobile={'주차장', '주유소', '렌트카', '기타자동차서비스', '자동차부품', '견인서비스', '자동차정비', 'LPG', '세차장', '자동차시트타이어', '택시', '중고자동차', '수입자동차', '유류판매', '카인테리어', '기타교통수단', '이륜차판매', '윤활유전문판매'}
    service={'화원', '화물운송', '사진관', '보관창고업','미용원','사무서비스','여객선', '가례서비스', '기타대인서비스', '기타수리서비스', '법률회계서비스', '사무서비스(회원제형태)','조세서비스', '기타용역서비스', '부동산분양', '기타유통업', '종합용역', '기타운송', '사무통신기기수리', '가정용품수리','위탁급식업', '중장비수리', '부동산중개임대', '신변잡화수리', '손해보험', '정기간행물', '건강식품(회원제형태)','기타보험', '손해보험', '기타비영리유통','사우나','세탁소', '통신기기'}
    dinning={'일반한식', '서양음식', '일식회집', '중국음식'}

    rename_key=[education,entertain,medical,beauty,shopping,grocery,travel,construction_etc,liquor,leisure,agriculture,housing,automobile,service,dinning]
    rename_value=['education','entertain','medical','beauty','shopping','grocery','travel','construction','liquor','leisure','agriculture','housing','automobile','service','dinning']

    zip_rename=list(zip(rename_key,rename_value)
    
    )
    return zip_rename

